Annihilation1019/STM32-based-Self-Balancing-Vehicle/Hardware/Motor.h
#ifndef __MOTOR_H
#define __MOTOR_H

#include "stm32f1xx_hal.h"

#define PWM_MAX 3600
#define PWM_MIN -3600
#define AIN1_SET() HAL_GPIO_WritePin(AIN1_GPIO_Port, AIN1_Pin, GPIO_PIN_SET)
#define AIN1_RESET() HAL_GPIO_WritePin(AIN1_GPIO_Port, AIN1_Pin, GPIO_PIN_RESET)
#define AIN2_SET() HAL_GPIO_WritePin(AIN2_GPIO_Port, AIN2_Pin, GPIO_PIN_SET)
#define AIN2_RESET() HAL_GPIO_WritePin(AIN2_GPIO_Port, AIN2_Pin, GPIO_PIN_RESET)
#define BIN1_SET() HAL_GPIO_WritePin(BIN1_GPIO_Port, BIN1_Pin, GPIO_PIN_SET)
#define BIN1_RESET() HAL_GPIO_WritePin(BIN1_GPIO_Port, BIN1_Pin, GPIO_PIN_RESET)
#define BIN2_SET() HAL_GPIO_WritePin(BIN2_GPIO_Port, BIN2_Pin, GPIO_PIN_SET)
#define BIN2_RESET() HAL_GPIO_WritePin(BIN2_GPIO_Port, BIN2_Pin, GPIO_PIN_RESET)

void Motor_Init(void);
void Motor_Control(int16_t SpeedA, int16_t SpeedB);
void Motor_Limit(int *MotorA, int *MotorB);
int abs(int x);

#endif // __MOTOR_H